Table of Contents
 Class InternalForcesBuilder<T>
Namespace
IdeaStatiCa.BimApiLink.Results
Assembly
IdeaStatiCa.BimApiLink.dll
public sealed class InternalForcesBuilder<T> : BimLinkObject, IEnumerable<ResultsData<T>>, IEnumerable where T : IIdeaObjectWithResults
Type Parameters
T
Inheritance
object
ScopeAwareObject
BimLinkObject
InternalForcesBuilder<T>
Implements
IEnumerable<ResultsData<T>>
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Constructors
 InternalForcesBuilder(ResultLocalSystemType)
public InternalForcesBuilder(ResultLocalSystemType resultLocalSystem)
Parameters
resultLocalSystem ResultLocalSystemType
Methods
 For(Identifier<T>, IIdeaLoadCase)
public InternalForcesBuilder<T>.Sections For(Identifier<T> objIdentifier, IIdeaLoadCase loadCase)
Parameters
objIdentifier Identifier<T>
loadCase IIdeaLoadCase
Returns
InternalForcesBuilder<T>.Sections
 For(T, IIdeaLoadCase)
public InternalForcesBuilder<T>.Sections For(T obj, IIdeaLoadCase loadCase)
Parameters
obj T
loadCase IIdeaLoadCase
Returns
InternalForcesBuilder<T>.Sections
 For(T, Identifier<IIdeaLoadCase>)
public InternalForcesBuilder<T>.Sections For(T obj, Identifier<IIdeaLoadCase> loadCaseIdentifier)
Parameters
obj T
loadCaseIdentifier Identifier<IIdeaLoadCase>
Returns
InternalForcesBuilder<T>.Sections
 GetEnumerator()
Returns an enumerator that iterates through the collection.
public IEnumerator<ResultsData<T>> GetEnumerator()
Returns
IEnumerator<ResultsData<T>>
An enumerator that can be used to iterate through the collection.
 Edit this page